Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.SetTerminationOrientation(System.Int32,Autodesk.Revit.DB.Structure.RebarTerminationOrientation)
Sets the orientation of the termination's (e.g. hook, crank) plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal. This information is set to the rebar after the API execution is finished successfully.
end:
The end of bar. Should be 0 for start or 1 for end.
terminationOrientation:
The termination's orientation at end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetRebarId
Get the id of the Rebar element currently being calculated.
Returns:
Returns the id of the Rebar element currently being calculated
Since:
2020

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetTerminationRotationAngle(System.Int32)
Gets the termination's (e.g hook, crank) rotation angle (in radians) at end that is currently in the rebar.
end:
The end of bar. Should be 0 for start or 1 for end.
Returns:
Returns the termination's (e.g hook, crank) rotation angle (in radians) at end that is currently in the rebar.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
Since:
2026

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.SetTerminationRotationAngle(System.Int32,System.Double)
Sets the termination's (e.g hook, crank) rotation angle (in radians) at end. This information is set to the rebar after the API execution is finished successfully.
end:
The end of bar. Should be 0 for start or 1 for end.
angle:
The termination's (e.g hook, crank) rotation angle (in radians) at end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for angle is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
Since:
2026

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetTerminationPlaneNormalForBarIdx(System.Int32,System.Int32)
Gets the plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex that is currently in Rebar.
Remarks:
This method does not take into account the rotation of the bar relative to its default position along the distribution path.
end:
The end of bar. Should be 0 for start or 1 for end.
barPositionIndex:
An index between 0 and (GetNumberOfBars()-1).
Returns:
Returns the plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex that is currently in Rebar.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, GetNumberOfBars()-1 ].
-or-
Invalid end.
Since:
2026

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.SetTerminationPlaneNormalForBarIdx(System.Int32,System.Int32,Autodesk.Revit.DB.XYZ)
Sets the plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex will stay. This information is set to the rebar after the API execution is finished successfully.
Remarks:
This information is set to the rebar after the API execution is finished successfully. Before setting the value a validation will be done.
We consider a termination's plane normal valid if it's perpendicular with the bar direction at end.
This method does not take into account the rotation of the bar relative to its default position along the distribution path.
end:
The end of bar. Should be 0 for start or 1 for end.
barPositionIndex:
Index of the bar for which it will set the termination plane normal.
terminationPlaneNormal:
The plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex will stay.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
-or-
terminationPlaneNormal has zero length.
Since:
2026

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.AreOrientationOptionsChanged
Indicates if the orientation options have changed since the last regeneration.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.EndConstraintLostTargets
Indicates if the end handle constraint lost one or more targets in the last regeneration (i.e. structural was modified in a way that target faces changed or were removed).
Since:
2027

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.StartConstraintLostTargets
Indicates if the start handle constraint lost one or more targets in the last regeneration (i.e. structural was modified in a way that target faces changed or were removed).
Since:
2027

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsCustomSpacingFormulaChanged
Indicates if the custom formula has changed since the last regeneration.
Since:
2027